#d = []
#a = int(input())
#for i in range(1, a + 1):
#  if a % i == 0:
#    d.append(i)
#print(d)


#mas = [1,'Apple', 135, 7.8]

#for i in mas: #foreach
#    i = 1
#    i = 'Apple'
#    i = 135
#    i = 7.8

#for i in mas: #foreach
#    print( i )


#i = 0
#N = len(mas) # Размер массива, фунция len() возвращает  длину списка (массива)

#while i <= N - 1: # или  i < N
#    print( mas[i] )
#    i += 1

# НЕПРАВИЛЬНО
#for i in mas: #foreach
#    print(mas[i])


## Задача 1: найти сумму элементов массива чисел


str1 = "aboba"
str2 = "amogus"
# конкатенируем строки
str3 = str1 + str2
print(str3)
# --------------------- #
# сравнение строк
# будет введено ДВА нуклеотида и надо будет сравнить поэлементно и узнать сколько
# различий 












